{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.11.0",
  "convertedBy": null,
  "modelTopology": {
    "keras_version": "2.6.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "my_model",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                28,
                28,
                1
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            }
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [
                3,
                3
              ],
              "strides": [
                1,
                1
              ],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [
                1,
                1
              ],
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": {
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          ...
        ],
        "build_input_shape": [
          null,
          28,
          28,
          1
        ]
      }
    },
    "weightsManifest": [
      {
        "paths": [
          "group1-shard1of1.bin"
        ],
        "weights": [
          {
            "name": "conv2d/kernel",
            "shape": [
              3,
              3,
              1,
              32
            ],
            "dtype": "float32"
          },
          ...
        ]
      }
    ]
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1.bin"
      ],
      "weights": [
        {
          "name": "conv2d/kernel",
          "shape": [
            3,
            3,
            1,
            32
          ],
          "dtype": "float32"
        },
        ...
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.11.0",
  "convertedBy": null
}
